In [2]:
import pandas as pd
df1 = pd.DataFrame({
    'ID': [1,2,3],
    'Nombre': ['Ana', 'Luis', 'Carlos']
})

df2 = pd.DataFrame({
    'ID': [1,2,4],
    'Edad': [25,30,22]
})

df1

   ID  Nombre
0   1     Ana
1   2    Luis
2   3  Carlos

In [3]:
df2

   ID  Edad
0   1    25
1   2    30
2   4    22

In [4]:
## como combinar df con pandas? 
##MERGE() 
## ambos df comparten ciertos valores como los IDs.

df_combinado = pd.merge(df1, df2, on='ID')
df_combinado

   ID Nombre  Edad
0   1    Ana    25
1   2   Luis    30

In [5]:
## MERGE actua solo en donde hay valores en comun. En el ejemplo el ID 1 y 2, el 4 no

In [6]:
## el par√°metro how del merge por default viene en inner pero puede modificarse, para que haya registros no completos

In [8]:
##Ej merge con outer e incluye los faltantes
df_combinado = pd.merge(df1,df2, on='ID', how='outer')
df_combinado

   ID  Nombre  Edad
0   1     Ana  25.0
1   2    Luis  30.0
2   3  Carlos   NaN
3   4     NaN  22.0

In [9]:
##Ej merge con left (lo mismo pasaria en right)
df_combinado = pd.merge(df1,df2, on='ID', how='left')
df_combinado

   ID  Nombre  Edad
0   1     Ana  25.0
1   2    Luis  30.0
2   3  Carlos   NaN

In [11]:
df_indexado = pd.merge(df1, df2, left_index=True, right_index=True)
df_indexado

   ID_x  Nombre  ID_y  Edad
0     1     Ana     1    25
1     2    Luis     2    30
2     3  Carlos     4    22